/**
 * Java OOP. Home Work 06.
 *
 * @author Oleg Khrulov
 * @version dated 14.04.2019
 */

/*
        5) Реализуйте программу, которая с периодичностью 1 сек,
        будет проверять состояние заданного каталога. Если в этом
        каталоге появится новый файл или исчезнет существующий,
        то выведется сообщение об этом событии. Программа
        должна работать в параллельном потоке выполнения.
*/

package HW06.Task05;

public class MainHW06Task05 {
    public static void main(String[] args) {

    }
}
