/**
 * Java OOP. Home Work 11.
 *
 * @author Oleg Khrulov
 * @version dated 14.04.2019
 */

/*
        4. * Реализуйте веб интерфейс к классу Group. Т.е. на экране
        браузера должен отобразиться список методов, которые можно
        сделать с группой. При щелчке на ссылку соответствующего метода
        он должен выполниться. Результат работы, опять же, в виде html
        страницы должен возвращаться пользователю.
*/

package HW11.Task04;

public class MainHW11Task04 {
    public static void main(String[] args) {

    }
}