/**
 * Java OOP. Home Work 08.
 *
 * @author Oleg Khrulov
 * @version dated 14.04.2019
 */

/*
        2) Создайте класс-контейнер типа стек (класс в который можно добавлять и
        удалять объекты других классов, только в вершину стека), в который
        можно сохранять объекты произвольного типа. Должен быть метод
        добавления элемента в стек, получение с удалением элемента из стека, и
        просто получение элемента из вершины из стека. Должна быть
        реализована работа с «черным списком» классов (смотри ниже). Если
        объект который добавляется в стек принадлежит классу из «черного
        списка», то добавление такого объекта запрещено.
*/

package HW08.Task02;

public class MainHW08Task02 {
    public static void main(String[] args) {

    }
}
