/**
 * Java OOP. Home Work 01.
 *
 * @author Oleg Khrulov
 * @version dated 07.04.2019
 */

/*
        Описать класс «Vector3d» (т. е., он должен описывать вектор в трехмерной,
        декартовой системе координат). В качестве свойств этого класса возьмите
        координаты вектора. Для этого класса реализовать методы сложения, скалярного и
        векторного произведения векторов. Создайте несколько объектов этого класса и
        протестируйте их.
*/

package HW01.Task03;

public class Vector3d {
}
