/**
 * Java OOP. Home Work 08.
 *
 * @author Oleg Khrulov
 * @version dated 14.04.2019
 */

/*
        3) Для описанного выше стека создайте класс «Черный список», в котором
        будут описаны классы объектов которые нельзя добавлять в стек.
        Должна быть возможность добавления классов в черный список, проверка
        объекта на то, что класс, к которому он принадлежит, принадлежит или не
        принадлежит к классам в черном списке.
*/

package HW08.Task03;

public class MainHW08Task03 {
    public static void main(String[] args) {

    }
}
