/**
 * Java OOP. Home Work 09.
 *
 * @author Oleg Khrulov
 * @version dated 14.04.2019
 */

/*
        4) Шелдон, Леонард, Воловиц, Кутрапалли и Пенни стоят в очереди
        за «двойной колой». Как только человек выпьет такой колы, он
        раздваивается и оба становятся в конец очереди, чтобы выпить еще
        стаканчик. Напишите программу, которая выведет на экран
        состояние очереди в зависимости от того, сколько стаканов колы
        выдал аппарат с чудесным напитком. Например, если было выдано
        только два стакана, то очередь выглядит как:
        [Volovitc, Kutrapalli, Penny, Sheldon, Sheldon, Leonard, Leonard]
*/

package HW09.Task04;

public class MainHW09Task04 {
    public static void main(String[] args) {

    }
}
