/**
 * Java OOP. Home Work 04.
 *
 * @author Oleg Khrulov
 * @version dated 14.04.2019
 */

/*
        1. Усовершенствуйте класс Group, добавив возможность
        интерактивного добавления объекта.
        2. Реализуйте возможность сортировки списка студентов
        по фамилии.
        3. Реализуйте возможность сортировки по параметру
        (Фамилия, успеваемость и т. д.).
        4. Реализуйте интерфейс Военком, который вернет из группы
        массив студентов - юношей, которым больше 18 лет.
        5. Протестируйте его работу.
*/

package HW04;

public class Group {
}
